start_message = (
    "Привет! 👋 Я твой личный финансовый помощник.\n"
    "Готов помочь управлять твоими тратами и бюджетом. 💰\n"
    "Что будем делать сегодня?"
)

create_category_message = "Введи название новой категории:"
create_category_success = "Готово! Категория добавлена ✅"
create_category_error = "Не получилось создать категорию. Попробуй ещё раз."

choose_category = "Выбери категорию:"
choose_category_error = "Не удалось получить список категорий."

rename_category_msg = "Введи новое название категории:"
rename_category_success = "Переименовано ✅"
rename_category_error = "Ошибка при переименовании. Попробуй ещё раз."

delete_category_confirmation_msg = (
    "❗️Ты уверен, что хочешь удалить категорию *{category_name}*?\n"
    "Добавление новых трат станет недоступным, но старые останутся в статистике.\n\n"
    "*Это действие нельзя отменить.*"
)
delete_category_success = "Категория удалена 🗑️"
delete_category_cancel_msg = "Удаление отменено."
delete_category_error = "Что-то пошло не так при удалении. Попробуй ещё раз."
delete_msg_error = "Не получилось удалить сообщение. Попробуй ещё раз."

write_down_expense_choose_category_msg = "В какую категорию записать трату?"
write_down_expense_msg = "И сколько ты потратил(-а)?"
write_down_expense_success = "Записал 💾"
enter_amount_error = "Введи сумму корректно (например: 2500 или 1500.50)"
write_down_expense_error = "Не удалось записать трату. Попробуй снова."

error_user_not_found = "Не удалось найти твои данные. Пожалуйста, начни с команды /start."
error_category_not_found = "Категория не найдена."

select_statistics_interval = "Выбери период:"
statistics_interval_error = "Ошибка при выборе периода 😕"
statistics_error = "Не удалось получить статистику. Попробуй позже."
